# Brewfile - Dependency Management for Dotfiles
# Install all dependencies: brew bundle install

# ══════════════════════════════════════════════════════════════════════
# Taps
# ══════════════════════════════════════════════════════════════════════
tap "FelixKratz/formulae"       # For borders, sketchybar
tap "nikitabobko/tap"            # For aerospace

# ══════════════════════════════════════════════════════════════════════
# Core Shell & Terminal
# ══════════════════════════════════════════════════════════════════════
brew "stow"                      # Symlink management
brew "zsh"                       # Shell (keep updated)
brew "starship"                  # Cross-shell prompt
cask "wezterm"                   # GPU-accelerated terminal

# ══════════════════════════════════════════════════════════════════════
# Window Management & Desktop
# ══════════════════════════════════════════════════════════════════════
cask "aerospace"                 # i3-like tiling window manager
brew "borders"                   # JankyBorders - window borders
brew "sketchybar"                # Custom macOS menu bar
cask "karabiner-elements"        # Keyboard customization

# ══════════════════════════════════════════════════════════════════════
# Editor
# ══════════════════════════════════════════════════════════════════════
brew "neovim"                    # Hyperextensible Vim-based editor

# ══════════════════════════════════════════════════════════════════════
# Modern CLI Tools (Rust-based, Fast)
# ══════════════════════════════════════════════════════════════════════
brew "eza"                       # Modern ls (exa fork, maintained)
brew "bat"                       # Cat with syntax highlighting
brew "ripgrep"                   # Fast grep (rg)
brew "fd"                        # Fast find
brew "fzf"                       # Fuzzy finder
brew "zoxide"                    # Smart cd
brew "delta"                     # Better git diffs
brew "direnv"                    # Load/unload env vars by directory
brew "tldr"                      # Simplified man pages
brew "htop"                      # Process viewer
brew "tree"                      # Directory tree view
brew "jq"                        # JSON processor
brew "wget"                      # Internet file retriever

# ══════════════════════════════════════════════════════════════════════
# Development Tools
# ══════════════════════════════════════════════════════════════════════
brew "git"                       # Version control
brew "gh"                        # GitHub CLI
brew "lazygit"                   # Terminal UI for git
brew "lazydocker"                # Terminal UI for docker
brew "nvm"                       # Node version manager
brew "pnpm"                      # Fast, disk space efficient package manager
brew "uv"                        # Python package installer and resolver

# ══════════════════════════════════════════════════════════════════════
# Fonts
# ══════════════════════════════════════════════════════════════════════
cask "font-jetbrains-mono-nerd-font"  # Programming font with icons
cask "sf-symbols"                     # Apple SF Symbols (for SketchyBar)
