# Brewfile - Dependency Management for Dotfiles
# Install all dependencies: brew bundle install

# ══════════════════════════════════════════════════════════════════════
# Taps
# ══════════════════════════════════════════════════════════════════════
tap "DomT4/autoupdate"           # For brew-autoupdate (automated maintenance)
tap "FelixKratz/formulae"       # For borders, sketchybar
tap "nikitabobko/tap"            # For aerospace
tap "ngrok/ngrok"                # For ngrok cask
tap "oven-sh/bun"                # For bun JavaScript runtime
tap "supabase/tap"               # For supabase CLI
tap "stripe/stripe-cli"          # For stripe CLI
tap "joncrangle/tap"             # For sketchybar-system-stats

# ══════════════════════════════════════════════════════════════════════
# Core Shell & Terminal
# ══════════════════════════════════════════════════════════════════════
brew "stow"                      # Symlink management
brew "zsh"                       # Shell (keep updated)
brew "starship"                  # Cross-shell prompt
cask "wezterm"                   # GPU-accelerated terminal

# ══════════════════════════════════════════════════════════════════════
# Window Management & Desktop
# ══════════════════════════════════════════════════════════════════════
cask "aerospace"                 # i3-like tiling window manager
brew "borders"                   # JankyBorders - window borders
brew "sketchybar"                # Custom macOS menu bar
cask "karabiner-elements"        # Keyboard customization

# ══════════════════════════════════════════════════════════════════════
# Editor
# ══════════════════════════════════════════════════════════════════════
brew "neovim"                    # Hyperextensible Vim-based editor

# ══════════════════════════════════════════════════════════════════════
# Modern CLI Tools (Rust-based, Fast)
# ══════════════════════════════════════════════════════════════════════
brew "eza"                       # Modern ls (exa fork, maintained)
brew "bat"                       # Cat with syntax highlighting
brew "ripgrep"                   # Fast grep (rg)
brew "fd"                        # Fast find
brew "fzf"                       # Fuzzy finder
brew "zoxide"                    # Smart cd
brew "delta"                     # Better git diffs
brew "direnv"                    # Load/unload env vars by directory
brew "tldr"                      # Simplified man pages
brew "htop"                      # Process viewer
brew "tree"                      # Directory tree view
brew "jq"                        # JSON processor
brew "wget"                      # Internet file retriever

# ══════════════════════════════════════════════════════════════════════
# Development Tools
# ══════════════════════════════════════════════════════════════════════
brew "git"                       # Version control
brew "gh"                        # GitHub CLI
brew "lazygit"                   # Terminal UI for git
brew "lazydocker"                # Terminal UI for docker
brew "nvm"                       # Node version manager
brew "pnpm"                      # Fast, disk space efficient package manager
brew "uv"                        # Python package installer and resolver
brew "oven-sh/bun/bun"           # Fast JavaScript runtime (alternative to Node)
brew "supabase/tap/supabase"     # Supabase CLI for local development
brew "stripe/stripe-cli/stripe"  # Stripe CLI for API testing
brew "joncrangle/tap/sketchybar-system-stats"  # System stats for Sketchybar

# ══════════════════════════════════════════════════════════════════════
# Applications & Services
# ══════════════════════════════════════════════════════════════════════
cask "orbstack"                  # Docker desktop alternative (faster, lighter)
cask "docker-desktop"            # Docker desktop
cask "raycast"                   # Spotlight alternative with extensions
cask "discord"                   # Communication platform
cask "telegram"                  # Messaging app
cask "zoom"                      # Video conferencing
cask "keycastr"                  # Keystroke visualizer for screencasts
cask "ngrok"                     # Secure tunnels to localhost

# ══════════════════════════════════════════════════════════════════════
# Fonts
# ══════════════════════════════════════════════════════════════════════
cask "font-jetbrains-mono-nerd-font"  # Programming font with icons
cask "font-hack-nerd-font"            # Hack Nerd Font
cask "font-symbols-only-nerd-font"    # Nerd Font symbols only
cask "sf-symbols"                     # Apple SF Symbols (for SketchyBar)
